import React from 'react';
import './SettingsList.scss';
import closeSvg from '../../assets/img/icons/close.svg';

const SettingsList = () => {
  const [visiblePopup, setVisiblePopup] = React.useState(false);
  const [activeItem, setActiveItem] = React.useState(false);
  const onClose = () => {
    setVisiblePopup(false);
  };

  const toggleActive = (activeItem) => {
    setActiveItem(!activeItem);
  };

  return (
    <div className="settings">
      <div
        className="settings-list list-item"
        onClick={() => setVisiblePopup(!visiblePopup)}
      >
        <i className="icon">
          <svg
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            width="15"
            height="15"
            viewBox="0 0 20 20"
          >
            <path
              fill="#7C7C7C"
              d="M16.783 10c0-1.049 0.646-1.875 1.617-2.443-0.176-0.584-0.407-1.145-0.692-1.672-1.089 0.285-1.97-0.141-2.711-0.883-0.741-0.74-0.968-1.621-0.683-2.711-0.527-0.285-1.088-0.518-1.672-0.691-0.568 0.97-1.595 1.615-2.642 1.615-1.048 0-2.074-0.645-2.643-1.615-0.585 0.173-1.144 0.406-1.671 0.691 0.285 1.090 0.059 1.971-0.684 2.711-0.74 0.742-1.621 1.168-2.711 0.883-0.285 0.527-0.517 1.088-0.691 1.672 0.97 0.568 1.615 1.394 1.615 2.443 0 1.047-0.645 2.074-1.615 2.643 0.175 0.584 0.406 1.144 0.691 1.672 1.090-0.285 1.971-0.059 2.711 0.682s0.969 1.623 0.684 2.711c0.527 0.285 1.087 0.518 1.672 0.693 0.568-0.973 1.595-1.617 2.643-1.617 1.047 0 2.074 0.645 2.643 1.617 0.584-0.176 1.144-0.408 1.672-0.693-0.285-1.088-0.059-1.969 0.683-2.711 0.741-0.74 1.622-1.166 2.711-0.883 0.285-0.527 0.517-1.086 0.692-1.672-0.973-0.569-1.619-1.395-1.619-2.442zM10 13.652c-2.018 0-3.653-1.635-3.653-3.652 0-2.018 1.636-3.654 3.653-3.654s3.652 1.637 3.652 3.654c0 2.018-1.634 3.652-3.652 3.652z"
            ></path>
          </svg>
        </i>
        <span>Настройки</span>
      </div>
      {visiblePopup && (
        <div className="add-list__popup">
          <img
            onClick={onClose}
            className="add-list__popup-close-btn"
            src={closeSvg}
            alt="close button"
          />
          <div className="popup-list">
            <span>В разработке</span>
            <div
              className={activeItem ? 'active' : null}
              onClick={() => toggleActive(activeItem)}
            >
              <svg
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                width="20"
                height="20"
                viewBox="0 0 32 32"
              >
                <path d="M16.938 7.938c0.552 0 1-0.448 1-1v-2c0-0.552-0.448-1-1-1s-1 0.448-1 1v2c0 0.552 0.448 1 1 1zM16.938 25.938c-0.552 0-1 0.448-1 1v2c0 0.552 0.448 1 1 1s1-0.448 1-1v-2c0-0.552-0.448-1-1-1zM9.16 23.302l-1.414 1.414c-0.391 0.391-0.391 1.023 0 1.414s1.023 0.391 1.414 0l1.414-1.414c0.391-0.392 0.391-1.023 0-1.414s-1.023-0.392-1.414 0zM7.938 16.938c0-0.552-0.448-1-1-1h-2c-0.552 0-1 0.448-1 1s0.448 1 1 1h2c0.552 0 1-0.448 1-1zM9.159 10.573c0.391 0.391 1.024 0.391 1.414 0s0.391-1.023 0-1.414l-1.414-1.414c-0.391-0.391-1.023-0.391-1.414 0s-0.391 1.023 0 1.414l1.414 1.414zM20.938 9.938c-0.699 0-1.363 0.135-2 0.325-0.637-0.19-1.301-0.325-2-0.325-3.859 0-7 3.141-7 7s3.141 7 7 7c0.699 0 1.363-0.135 2-0.326 0.637 0.19 1.301 0.326 2 0.326 3.859 0 7-3.141 7-7s-3.141-7-7-7zM15.952 21.839c-2.29-0.458-4.014-2.477-4.014-4.901s1.724-4.443 4.014-4.901c-1.243 1.264-2.014 2.992-2.014 4.901s0.771 3.637 2.014 4.901z"></path>
              </svg>
            </div>
          </div>
        </div>
      )}
    </div>
  );
};

export default SettingsList;
